{
    "experiences": [
        {
            "title": "Software Engineer",
            "subtitle": "Juniper Networks",
            "workType": "Full-time",
            "workDescription": [
                "Created an UI based SaaS tool for the product offerings of Juniper for consumers by integrating 4 internal CLI tools which led to reduction in testing time by 40%.",
                "Integrated Mist AI API endpoints with SaaS tool to automate event correlation, root cause identification and anomaly detection.",
                "Used python as a scripting language to setup automations to provision Linux VM instances, collect telemetry data and write to an influx time-series database.",
                "Wrote reusable unit test documents to ensure quality control and detect bugs by over 35% efficiency rate and automated the bringing up of server instances in the event of failures."
            ],
            "dateText": "2018 – 2022"
        },
        {
            "title": "Product Engineer",
            "subtitle": "INSZoom.Inc",
            "workType": "Full-time",
            "workDescription": [
                "Analyzed requirements and designed software solution specifications for development requirements.",
                "Implemented MVC architecture on .NET framework.",
                "Isolated, recreated and provided fixes for the bugs reported at the production environment.",
                "Participated in code reviews."
            ],
            "dateText": "2017 – 2017"
        },
        {
            "title": "Assistant Software Engineer",
            "subtitle": "KPIT Technologies",
            "workType": "Full-time",
            "workDescription": [
                "Participated in requirement gathering from client and update the existing modules based on client request.",
                "Contributed to design and development of client and server database application.",
                "Tested and validated the application on different testing environments and deployed the web application."
            ],
            "dateText": "2013 – 2014"
        }
    ]
}